/* 
  Strings for the File Provider extension's info.plist
*/

/* Tooltip for files and folders in the pinned state */
"Always Available on This Device" = "Always Available on This Device";

/* Tooltip for files and folders which are shared with other users. */
"Shared" = "Shared";

/* Tooltip for files and folders which can only be read and not written to. */
"Read Only" = "Read Only";

/* Tooltip for files and folders which are shared AND in the pinned state. */
"Shared and Always Available on This Device" = "Shared and Always Available on This Device";

/* Tooltip for files and folders in the pinned state AND cannot be written to */
"Read Only and Always Available on This Device" = "Read Only and Always Available on This Device";

/* Tooltip for files and folders which are shared with other users AND cannot be written to */
"Shared and Read Only" = "Shared and Read Only";

/* Tooltip for files and folders in the pinned state AND shared with other users AND cannot be written to */
"Shared, Read Only, and Always Available on This Device" = "Shared, Read Only, and Always Available on This Device";

/* Tooltip for files excluded from syncing. Ex: HVEL, LVEL and ODIgnored */
"Ignored" = "Excluded from sync";

/* A right click context menu option displayed when the user right clicks a file that OneDrive is syncing and the Mac Files on Demand (Placeholders) feature is enabled. This command lets the user indicate that they want to keep the content of this file or folder on disk. This translates to hydrating any files or folders that are dehydrated and setting the pin state to pinned on them. */
"Always Keep on This Device" = "Always Keep on This Device";

/* A right click context menu option displayed when the user right clicks a file that OneDrive is syncing and the Mac Files on Demand (Placeholders) feature is enabled. This command lets the user indicate that they want to free up space and therefore not store the content of this file or folder on disk. This translates to dehydrating any files or folders that are not already dehydrated and setting the pin state to unpinned on them. */
"Free Up Space" = "Free Up Space";

/* A right click context menu option displayed when the user right clicks one or multiple Added Folder shortcuts that OneDrive is syncing. This command will remove the shortcuts and unmount the Added Folder (action) */
"Remove Shortcut" = "Remove Shortcut";

/* A tooltip for a custom icon on a team site folder. */
"Team Site" = "Shared Library";

/* A tooltip for a custom icon on an added/shortcut folder. */
"Shortcut" = "Shortcut";
